# И.
zero = ''
from0To2_I = [zero, 'одна', 'две'];
from0To19_I = [zero, 'одна', 'две', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять',
             'десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
             'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать'];
tens_I = ['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто', zero];
hundreds_I = ['сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот'];
thousands_I = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];


# Р.
from0To2_R = [zero, 'одна', 'две'];
from0To19_R = [zero, 'одиного', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_R = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_R = ['ста', 'двухсот', 'трехсот', 'четырехсот', 'пятьста', 'шестиста', 'семиста', 'восьмиста', 'девятиста'];
thousands_R = [['', '', ''],
             ['тысяч', 'тысяч', 'тысяч'],
             ['миллионов', 'миллионов', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# Д.
from0To2_D = [zero, 'одна', 'две'];
from0To19_D = [zero, 'одиного', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_D = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_D = ['ста', 'двухсот', 'трехсот', 'четырехсот', 'пятьста', 'шестиста', 'семиста', 'восьмиста', 'девятиста'];
thousands_D = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# В.
from0To2_B = [zero, 'одна', 'две'];
from0To19_B = [zero, 'одиного', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_B = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_B = ['ста', 'двухсот', 'трехсот', 'четырехсот', 'пятьста', 'шестиста', 'семиста', 'восьмиста', 'девятиста'];
thousands_B = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# Т.
from0To2_T = [zero, 'одна', 'две'];
from0To19_T = [zero, 'одиного', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_T = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_T = ['ста', 'двухсот', 'трехсот', 'четырехсот', 'пятьста', 'шестиста', 'семиста', 'восьмиста', 'девятиста'];
thousands_T = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# П.
from0To2_P = [zero, 'одна', 'две'];
from0To19_P = [zero, 'одиного', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_P = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_P = ['ста', 'двухсот', 'трехсот', 'четырехсот', 'пятьста', 'шестиста', 'семиста', 'восьмиста', 'девятиста'];
thousands_P = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];


