# И.
zero = ''
from0To2_I = [zero, 'одна', 'две'];
from0To19_I = [zero, 'одна', 'две', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять',
             'десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
             'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать'];
tens_I = ['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто', zero];
hundreds_I = ['сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот'];
thousands_I = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];


# Р.
from0To2_R = [zero, 'одна', 'две'];
from0To19_R = [zero, 'одного', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_R = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_R = ['ста', 'двухсот', 'трехсот', 'четырехсот', 'пятьста', 'шестиста', 'семиста', 'восьмиста', 'девятиста'];
thousands_R = [['', '', ''],
             ['тысяч', 'тысяч', 'тысяч'],
             ['миллионов', 'миллионов', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# Д.
from0To2_D = [zero, 'одна', 'две'];
from0To19_D = [zero, 'одному', 'двум', 'трем', 'четырем', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_D = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_D = ['ста', 'двумстам', 'тремстам', 'четырестам', 'пятистам', 'шестистам', 'семистам', 'восьмистам', 'девятистам'];
thousands_D = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# В.
from0To2_B = [zero, 'одна', 'две'];
from0To19_B = [zero, 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять',
             'десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
             'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать'];
tens_B = ['десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемдесят', 'девяносто', zero];
hundreds_B = ['сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот', 'девятьсот'];
thousands_B = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# Т.
from0To2_T = [zero, 'одна', 'две'];
from0To19_T = [zero, 'одним', 'двумя', 'тремя', 'четырмя', 'пятью', 'шестью', 'семью', 'восемью', 'девятью',
             'десятью', 'одиннадцатью', 'двенадцатью', 'тринадцатью', 'четырнадцатью', 'пятнадцатью',
             'шестнадцатью', 'семнадцатью', 'восемнадцатью', 'девятнадцатью'];
tens_T = ['десятью', 'двадцатью', 'тридцатью', 'сорока', 'пятьюдесятью', 'шестьюдесятью', 'семьюдесятью', 'восьюмидесятью', 'девятьюдесятью', zero];
hundreds_T = ['ста', 'двухстами', 'тремястами', 'четырмястами', 'пятьюстами', 'шестьюстами', 'семьюстами', 'восьмьюстами', 'девятьюстами'];
thousands_T = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

# П.
from0To2_P = [zero, 'одна', 'две'];
from0To19_P = [zero, 'одном', 'двух', 'трех', 'четырех', 'пяти', 'шести', 'семи', 'восьми', 'девяти',
             'десяти', 'одиннадцати', 'двенадцати', 'тринадцати', 'четырнадцати', 'пятнадцати',
             'шестнадцати', 'семнадцати', 'восемнадцати', 'девятнадцати'];
tens_P = ['десяти', 'двадцати', 'тридцати', 'сорока', 'пятьдесяти', 'шестьдесяти', 'семьдесяти', 'восьмидесяти', 'девяноста', zero];
hundreds_P = ['ста', 'двухстах', 'трехстах', 'четырехста', 'пятистах', 'шестистах', 'семистах', 'восьмистах', 'девятистах'];
thousands_P = [['', '', ''],
             ['тысяча', 'тысячи', 'тысяч'],
             ['миллион', 'миллиона', 'миллионов'],
             ['миллиард', 'миллиарда', 'миллиардов']];

